tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "diff-so-fancy"
brew "exa"
brew "fzf"
brew "go"
brew "libksba"
brew "libtool"
brew "libyaml"
brew "neovim"
brew "openssl@1.1"
brew "pkg-config"
brew "readline"
brew "ripgrep"
brew "rustup-init"
brew "zlib"
brew "zoxide"
cask "alfred"
cask "authy"
cask "brave-browser"
cask "discord"
cask "font-fira-code"
cask "hammerspoon"
cask "hyperkey"
cask "iterm2"
cask "maccy"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "zoom"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "GitLab.gitlab-workflow"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "JuanBlanco.solidity"
vscode "mquandalle.graphql"
vscode "ms-playwright.playwright"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "SimonSiefke.svg-preview"
vscode "spoonscen.es6-mocha-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
