tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "coreutils"
brew "diff-so-fancy"
brew "docker"
brew "exa"
brew "fd"
brew "fzf"
brew "libksba"
brew "libusb"
brew "gnupg"
brew "go"
brew "jq"
brew "libtool"
brew "libyaml"
brew "neovim"
brew "nginx"
brew "pinentry-mac"
brew "pkg-config"
brew "powerlevel10k"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "wireguard-tools"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
cask "1password"
cask "alfred"
cask "authy"
cask "brave-browser"
cask "discord"
cask "ferdium"
cask "hammerspoon"
cask "hyperkey"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "mongodb-compass"
cask "postman"
cask "rescuetime"
cask "slack"
cask "telegram"
cask "todoist"
cask "viber"
cask "visual-studio-code"
cask "zoom"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "Codeium.codeium"
vscode "Codium.codium"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hbenl.vscode-mocha-test-adapter"
vscode "hbenl.vscode-test-explorer"
vscode "jebbs.plantuml"
vscode "JuanBlanco.solidity"
vscode "kodebox.solidity-language-server"
vscode "mquandalle.graphql"
vscode "ms-playwright.playwright"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "NomicFoundation.hardhat-solidity"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "spoonscen.es6-mocha-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "TabNine.tabnine-vscode"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
